845-369-6869
ABOUT US
PORTFOLIO
SERVICES
APPS
NEWS
CONTACT
CLIENT LOGIN

Custom Search

Home › Blog › Embed Google's Pac-Man Doodle
How To Get Google's Pac Man Game On Your Page
Published May 21, 2010


People have been asking how they can embed the Google Pac Man Doodle on their web pages.  I decided to pull together a quick embed code to allow people to do so, as long as Google keeps the files live.

Currently, the sound is not working on the embed because Google has disabled it due to annoying users. Also, it does not work with the Prototype Javascript Library. To see an example of this working, click here.

Here is the embed code:

<script>window.google={kEI:"Quz2S63qIYeglAfw8oHGCg",kEXPI:"17259,23663,24477,24661,24745,24770,24808",kCSI:{e:"17259,23663,24477,24661,24745,24770,24808",ei:"Quz2S63qIYeglAfw8oHGCg",expi:"17259,23663,24477,24661,24745,24770,24808"},ml:function(){},pageState:"#",kHL:"en",time:function(){return(new Date).getTime()},log:function(b,d,c){var a=new Image,e=google,g=e.lc,f=e.li;a.onerror=(a.onload=(a.onabort=function(){delete g[f]}));g[f]=a;c=c||"/gen_204?atyp=i&ct="+b+"&cad="+d+"&zx="+google.time();a.src=c;e.li=f+1},lc:[],li:0,j:{en:1,l:function(){},e:function(){},b:location.hash&&location.hash!="#",bv:3,pl:[],mc:0,sc:0.5},Toolbelt:{}};(function(){for(var d=0,c;c=["ad","bc","p","pa","zd","ac","pc","pah","ph","sa","xx","zc","zz"][d++];)(function(a){google.j[a]=function(){google.j.pl.push([a,arguments])}})(c)})();
 window.google.sn="webhp";window.google.timers={load:{t:{start:(new Date).getTime()}}};try{window.google.pt=window.gtbExternal&&window.gtbExternal.pageT();}catch(u){}window.google.jsrt_kill=1;
 </script>
 <style>
 </style>

  
<script>var _gjwl=location;function _gjuc(){var b=_gjwl.href.indexOf("#");if(b>=0){var a=_gjwl.href.substring(b+1);if(/(^|&)q=/.test(a)&&a.indexOf("#")==-1&&!/(^|&)cad=h($|&)/.test(a)){_gjwl.replace("/search?"+a.replace(/(^|&)fp=[^&]*/g,"")+"&cad=h");return 1}}return 0}function _gjp(){!(window._gjwl.hash&&window._gjuc())&&setTimeout(_gjp,500)};
 google.y={};google.x=function(e,g){google.y[e.id]=[e,g];return false};if(!window.google)window.google={};window.google.crm={};window.google.cri=0;window.clk=function(e,f,g,k,l,b,m){if(document.images){var a=encodeURIComponent||escape,c=new Image,h=window.google.cri++;window.google.crm[h]=c;c.onerror=(c.onload=(c.onabort=function(){delete window.google.crm[h]}));if(b&&b.substring(0,6)!="&sig2=")b="&sig2="+b;c.src=["/url?sa=T","",f?"&oi="+a(f):"",g?"&cad="+a(g):"","&ct=",a(k||"res"),"&cd=",a(l),"&ved=",a(m),e?"&url="+a(e.replace(/#.*/,"")).replace(/\+/g,"%2B"):"","&ei=","Quz2S63qIYeglAfw8oHGCg",b].join("")}return true};
 window.gbar={qs:function(){},tg:function(e){var o={id:'gbar'};for(i in e)o[i]=e[i];google.x(o,function(){gbar.tg(o)})}};</script>
 </head>
 <!-- textarea id=csi style=display:none>
 </textarea -->
 <script>if(google.j.b)document.body.style.visibility='hidden';</script>
 <iframe name=wgjf style=display:none src="" onload="google.j.l()" onerror="google.j.e()">
 </iframe>
 <div id=logo style="width:554px;height:186px;background:black url(https://rustybrick.s3.amazonaws.com/pacman10-hp.png) 0 0 no-repeat;position:relative;margin-bottom:9px" title="PAC-MAN's 30th Birthday! Doodle with PAC-MANÙ & É±980 NAMCO BANDAI Games Inc.">
 <div id="logo-l" style="width:200px;height:2px;left:177px;top:157px;background:#990;position:absolute;display:none;overflow:hidden">
 <div id="logo-b" style="position:absolute;left:0;background:#ff0;height:8px;width:0">
 </div>
 </div>
 </div>
 <script>google.pml=function(){function d(a){if(!google.pml_installed){google.pml_installed=true;if(!a){document.getElementById("logo").style.background="black";window.setTimeout(function(){var b=document.getElementById("logo-l");if(b)b.style.display="block"},400)}a=document.createElement("script");a.type="text/javascript";

  
a.src="https://rustybrick.s3.amazonaws.com/pacman10-hp.2.js";

  
google.dom.append(a)}}function e(){if(document.f&&document.f.btnI)document.f.btnI.onclick=function(){typeof google.pacman!="undefined"?google.pacman.insertCoin():d(false);return false}}if(!google.pml_loaded){google.pml_loaded=true;window.setTimeout(function(){document.f&&document.f.q&&document.f.q.value==""&&d(true)},1E4);e();google.rein&&google.rein.push(e);google.dstr&&google.dstr.push(function(){google.pacman&&google.pacman.destroy();if(google.pml_installed){for(var a=(document.getElementById("xjsc")||document.body).getElementsByTagName("script"),b=0,c;c=a[b++];)c.src.indexOf("/logos/js")!=-1&&google.dom.remove(c);google.pml_installed=false}});google.pacManQuery=function(){google.nav(document.getElementById("dlink").href)}}};</script>

  

 <form action="/search" name=f onsubmit="google.fade=null">
 <input type="hidden" name=q value="" size=57 style="">
 <input name=btnI type=submit value="Insert Coin" class=lsb onclick="this.checked=1">
 </form>

  
<div id=xjsd>
 </div>
 <div id=xjsi>
 <script>if(google.y)google.y.first=[];if(google.y)google.y.first=[];if(!google.xjs){google.dstr=[];google.rein=[];window.setTimeout(function(){var a=document.createElement("script");
 a.src="https://rustybrick.s3.amazonaws.com/jscript.js";

  
(document.getElementById("xjsd")||document.body).appendChild(a);if(google.timers&&google.timers.load.t)google.timers.load.t.xjsls=(new Date).getTime();},0);
 google.xjs=1};google.neegg=1;google.y.first.push(function(){google.ac.i(document.f,document.f.q,'','','ZAO1UHON4Cy3HD_vAXF7cQ',{o:1,sw:1});(function(){
 var h,i,j=1,k=google.time(),l=[];google.rein.push(function(){j=1;k=google.time()});google.dstr.push(function(){google.fade=null});function m(a,f){var b=[];for(var c=0,e;e=a[c++];){var d=document.getElementById(e);d&&b.push(d)}for(var c=0,g;g=f[c++];)b=b.concat(n(g[0],g[1]));for(var c=0;b[c];c++)b[c]=[b[c],"opacity",0,1,0,""];return b}function n(a,f){var b=[],c=new RegExp("(^|\\s)"+f+"($|\\s)");for(var e=0,d,g=document.getElementsByTagName(a);d=
 g[e++];)c.test(d.className)&&b.push(d);return b}google.fade=function(a){if(google.fx&&j){a=a||window.event;var f=1,b=google.time()-k;if(a&&a.type=="mousemove"){var c=a.clientX,e=a.clientY;f=(h||i)&&(h!=c||i!=e)&&b>600;h=c;i=e}if(f){j=0;google.fx.animate(600,m(["fctr","ghead","pmocntr","sbl","tba","tbe"],[["span","fade"],["div","fade"],["div","gbh"]]));for(var d=0;d<
 l.length;++d)if(typeof l[d]=="function")l[d]()}}};google.addFadeNotifier=function(a){l.push(a);if(!j)a()};
 })();
 ;google.History&&google.History.initialize('/')});if(google.j&&google.j.en&&google.j.xi){window.setTimeout(google.j.xi,0);google.fade=null;}google.pml && google.pml();</script>
 </div>
 <script>(function(){
 var b,d,e,f;function g(a,c){if(a.removeEventListener){a.removeEventListener("load",c,false);a.removeEventListener("error",c,false)}else{a.detachEvent("onload",c);a.detachEvent("onerror",c)}}function h(a){f=(new Date).getTime();++d;a=a||window.event;var c=a.target||a.srcElement;g(c,h)}var i=document.getElementsByTagName("img");b=i.length;d=0;for(var j=0,k;j<b;++j){k=i[j];if(k.complete||typeof k.src!="string"||!k.src)++d;else if(k.addEventListener){k.addEventListener("load",h,false);k.addEventListener("error",
 h,false)}else{k.attachEvent("onload",h);k.attachEvent("onerror",h)}}e=b-d;function l(){google.timers.load.t.ol=(new Date).getTime();google.timers.load.t.iml=f;google.kCSI.imc=d;google.kCSI.imn=b;google.kCSI.imp=e;google.report&&google.report(google.timers.load,google.kCSI)}if(window.addEventListener)window.addEventListener("load",l,false);else if(window.attachEvent)window.attachEvent("onload",l);google.timers.load.t.prt=(f=(new Date).getTime());
 })();

 

</script>

 

 powered by Disqus

Michael Butler
Michael joined the RustyBrick team in 2008 to focus on transitioning existing web sites to new & enhanced platforms. He graduated from Rutgers University in 2005 and holds a B.S. in Computer Science.

This article is under Geek Factor, Creative, Web Programming

There is 1 comment for this post

Related Articles
Google Street View Car
My Facebook Profile Is Verified
DJI Spark Grounded
Watch A Tree Fall On My House
DoorBot/Ring Acquired
READ MORE Articles >

Have it Delivered
Connect With Us
Send Us a Message
Do you wish to give us feedback on one of our apps, send us a message or explore a proposal? Fill out the form below and we'll get back to you pronto!


Name

Email

Telephone

Company Name

Comments
SEND MESSAGE
Visit Us
250 West Nyack Road, Suite #200 West Nyack, NY 10994
GET DIRECTIONS

Call Us Toll Free
877-GO-RUSTY
877-467-8789

Telephone
845-369-6869

Fax
845-228-8177

© 1994 - 2018 RustyBrick, Inc. • All Rights Reserved

RustyBrick Quick Service Overview: Web services; web design, web development, web programming, e-commerce, search engine optimization, .NET technologies web seminars services and more

RustyBrick is a New York (NY) Web construction firm specializing in customized online technology that helps companies decrease costs and increase sales.

ABOUT US
Our Team
Job Openings
Case Studies
Vision
Proven Process
Technologies
News
Contact
Partners
Client List
Testimonials
Terms of Use
Privacy Policy
App Privacy Policy
EULA
SERVICES
AMP Development
Analytics
Android App Development
Apple Watch App Dev
Backend Maintenance
Brand Strategy
Content Management
Conversions
Custom Applications
Custom Cloud Applications
Display Ads
E-Commerce
Email
Enterprise Software
Google Glass Development
iPhone App Development
Logo & Identity Design
Mobile
Mobile Development
Mobile Strategy
Online Marketing
PBX Configuration
Project Management
Prototyping
Self-Maintenance
SEO Consulting
Social
Web Design
Web Hosting
Web Software Strategy
Web Strategy
Wireframing
PORTFOLIO
Web Development
Mobile Development
Design & Branding
Custom Web Software
OUR APPS
Android Apps
Google Glass Apps
iPhone Apps
Web Software
SEO Tools
BLOG
Archives
CLIENT LOGIN
CONTACT US